# 25 задание
---
### Маски 
```python
from fnmatch import fnmatch
```
где
```
* - последовательность символов
? - один символ
```
### Делители
#### Основная теорема арифметики
```
Каждое натуральное число, большее 1, представимо в виде:
p1^a1 * p2^a2 * p3^a3 * ... * pn^an, где pi - простое число
едиственным образом
Количество делителей равно:
(a1 + 1)(a2 + 1)(a3 + 1) ... (an +1)
```


#### Примеры

Пример 1

```
Назовём нетривиальным делителем натурального числа его делитель, не равный единице и самому числу.
Найдите все натуральные числа, принадлежащие отрезку [525784203; 728943762] 
и имеющие ровно три нетривиальных делителя. Для каждого найденного числа запишите в ответе само число
и его наибольший нетривиальный делитель. Найденные числа расположите в порядке возрастания.
```
Решение
```
разложение числа на простые множители - p1^a1 * p2^a2 * p3^a3 ... 
количество делителей (a1 + 1)(a2 + 1)(a3 + 1) ... = 5
Т.к. 5 простое число, то такое число представимо в виде p^4 -> 5 делителей : 1, p, p^2, p^3, p^4,
поэтому можно перебирать числа в диапазоне и проверять их на простоту
[525784203^0.25;728943762^0.25] ~ 152;164
```
```python
def prime(x):
    if x == 1: return 0
    elif x == 2: return 1
    elif x % 2 == 0: return 0
    else:
        for i in range(2, int(x**0.5)):
            if x % i == 0:
                return 0
        return 1
       
       
for i in range(152, 164 + 1):
    if prime(i):
        print(i**4, i**3)
```
Пример 2
```
Найдите все натуральные числа, принадлежащие отрезку (100 000 000; 101 000 000],
у которых ровно три различных четных делителя. 
В ответе перечислите найденные числа в порядке возрастания, справа от каждого числа запишите 
его второй по величине нетривиальный делитель (не равный 1 и самому числу).
```
Решение
```
разложение числа на простые множители - 2^a1 * p2^a2 * p3^a3 ... т.к. у числа должно быть четным
количество делителей a1(a2 + 1)(a3 + 1) ... = 3, двойка должна входить обязательно
2^1 * p^2 -> 2, 2p, 2p^2
```
```python
def prime(x):
    if x == 1: return 0
    elif x == 2: return 1
    elif x % 2 == 0: return 0
    else:
        for i in range(2, int(x**0.5)):
            if x % i == 0:
                return 0
        return 1
       
       
for i in range(50_000_000, 50_500_000 + 1):
    if int(i**0.5)**2 == i and prime(int(i**0.5)):
        print(i * 2, 2 * int(i**0.5))
```
Пример 3
```
Найдите наименьшее натуральное число, которое имеет ровно 512 делителей.
```
Решение
```
разложение числа на простые множители - p1^a1 * p2^a2 * p3^a3 ... 
количество делителей (a1 + 1)(a2 + 1)(a3 + 1) ... = 512
2^1 * 3^1 * 5^1 * 7^1 * 11^1 * 13^1 * 17^1 * 19^1 * 23^1
2^3 * 3^1 * 5^1 * 7^1 * 11^1 * 13^1 * 17^1 * 19^1
2^3 * 3^3 * 5^1 * 7^1 * 11^1 * 13^1 * 17^1
2^7 * 3^3 * 5^1 * 7^1 * 11^1 * 13^1
Ответ: 17297280
```

